[
    {
        "text": "The easiest way to become rich? \nDon't buy things to impress broke people.\n\nA ₹1,000 T-shirt vs. a ₹10,000 one - same purpose.\nA used car vs. a luxury car—both take you from A to B.\nAn old iPhone vs. the latest model - same apps, same texts.\n\nThe difference?\nOne makes you look rich.\nThe other actually makes you rich.\n\nWe spend so much trying to impress people who don’t care.\nTrue wealth is when you stop chasing validation.\nBuild assets, not liabilities.",
        "engagement": 143,
        "line_count": 11,
        "language": "Hinglish",
        "tags": [
            "Finance",
            "Motivation"
        ]
    },
    {
        "text": "A Congress minister once said, 'When you are getting raped, lie down and enjoy it.'\n\nNo arrest. No nationwide outrage.\nNo calls for justice.\n\nBut today, people are demanding Ranveer’s arrest for an incest joke on a comedy show.\n\nSo let’s get this straight:\nA politician normalizing rape? Silence.\n\nA comedian making an inappropriate joke? Immediate outrage.\n\nDon't think that I have sympathy for Ranveer, I have the issue with prioritization of problems.\n\nAs women, we are told to stay silent when we are molested by family members.\n\n‘Don’t ruin the family name.’\n\n‘Who will marry you if this comes out?’\n\n‘It happens in every house. Adjust.’\n\nWe are expected to endure domestic abuse because:\n\n‘Shaadi mein compromise toh karna padta hai.’\n\n‘Ghar ki baat ghar mein rakhni chahiye.’\n\n‘Aurat hi ghar banati hai.’\n\nBut when a joke is made, suddenly, morality awakens.\n\nSuddenly, people care about what is offensive and inappropriate.\nWhere was this outrage when:\n\nMarital rape is still not criminalized?\n\nDomestic violence cases are dismissed as 'ghar ka maamla'?\n\nWomen reporting harassment are shamed instead of believed?\n\nThis isn’t about defending a joke. This is about society’s hypocrisy - where outrage is selective, and power decides whose voice matters.\n\nIf we put even half the energy we do into canceling celebrities into holding real abusers accountable, maybe this country would be safer for women.\n\nBut no, it's easier to be offended by words than by the system that allows real violence to continue.\n\nIf words hurt you more than actions, maybe it’s time to rethink what really needs to change.",
        "engagement": 180,
        "line_count": 29,
        "language": "English",
        "tags": [
            "Toxic Behavior",
            "Celebrity"
        ]
    },
    {
        "text": "My mother used my LinkedIn against me\n\nMum - When are you planning to get married?\nMe - Idk.\n\nMum - Do you have a boyfriend or something? let me know at least.\nMe - No.\n\nMum - Then who will you marry?\nMe - The guy that you'll get me.\n\nMum - Why will we search? Do it yourself.\nMe - When I had a bf, you said it's a bad thing and you'll find someone for me. No love marriages\n\nMum - How will I search? You have 90k+ followers on LinkedIn. 30k+ connections.\n\n'Ek real connection bhi bana le'\n\nI am sorry I had to say the last part in Hindi because it hurts more in that.",
        "engagement": 392,
        "line_count": 13,
        "language": "Hinglish",
        "tags": [
            "Relationships",
            "Social Media"
        ]
    },
    {
        "text": "I see the same job openings reposted by the employer again and again for the past 3 months.\n\nI don't understand what is the issue here.\nClearly, there is no intention of hiring.\n\nIs it just to collect data?\n\nIs it to look that they're growing?\n\nIs it a tactic to keep the job market hopeful while they have no real openings?\n\nWhatever the reason, it’s unfair to job seekers who invest time and effort into applying.\n\nIf you're a recruiter or a hiring manager, please only post roles that you genuinely intend to fill.\n\nPeople's careers aren't a marketing strategy.",
        "engagement": 274,
        "line_count": 9,
        "language": "English",
        "tags": [
            "Job Search"
        ]
    },
    {
        "text": "The Best ROI You’ll Ever Get-\n\nWe often think of ROI in terms of money, growth, or success. But the highest return on investment? It’s in people.\n\n- A kind word today might be remembered years later.\n\n- A supportive leader can change someone’s entire career.\n\n- A simple 'How are you?' can mean the world to someone struggling.\n\nThe best investments aren’t in stocks or assets - they’re in kindness, patience, and the people around us. And the best part? The returns come in the form of trust, gratitude, and a lasting impact.\n\nWho’s someone that invested in you with their kindness? Let’s take a moment to appreciate them.",
        "engagement": 44,
        "line_count": 11,
        "language": "English",
        "tags": [
            "Inspiration",
            "Leadership"
        ]
    },
    {
        "text": "Reminder -\n\nWhatever happened today, you did your best.\n\nYou made it through the day, take a deep breath.\n\nTake a deep breath, relax your shoulders, and let it go!\n\nYou deserve the rest :)\n\nTomorrow's a new day, a new opportunity!",
        "engagement": 161,
        "line_count": 6,
        "language": "English",
        "tags": [
            "Motivation"
        ]
    },
    {
        "text": "I just want to take a moment to remind you of something beautiful -\n\nYou are doing so much better than you think. \nYou are growing in ways you don’t even realize. \nYou are loved more than you can imagine. \n\nLife isn’t about having it all figured out. It’s about the little things -\n\nThe way your eyes light up when you talk about something you love. \n\nThe way you make others smile without even trying. \n\nThe way you keep going, even on the hard days. \n\nAnd oh, how wonderful it is that you exist! \n\nIf today feels heavy, I hope you find a moment of peace. \n\nIf today feels lonely, I hope you remember how many hearts you’ve touched. \n\nIf today feels like ‘just another day,’ I hope you notice the tiny, beautiful moments - the sun on your skin, the laughter of a stranger, the quiet warmth of being alive. \n\nYou are not here to be perfect. You are here to be *you* - and that is already enough. \n\nSo take a deep breath, give yourself a little grace, and know that this world is so much brighter because you are in it. \n\nSending you a big, warm hug. Keep shining.",
        "engagement": 129,
        "line_count": 17,
        "language": "English",
        "tags": [
            "Motivation"
        ]
    },
    {
        "text": "Went out today.\n\nSaw a man selling heart-shaped balloons.\n\nHe asked me to buy it, 'Lelo didi boyfriend ko de dena' (jale pe namak lagate hue)\n\nMe - 'Nahi hai boyfriend'\n\nHe said - 'Apne liye lelo, Valentine's Day hai aaj, pyaar ka dinn, khud ke liye lelo'\n\nSo, I have 2 heart balloons now.\n\n*Self-love ka kitna pressure hai*\n\nBhai, I don't want to buy myself flowers or chocolates.\n\nI don't want to be independent, I am a weak independent woman, bass hone hi waali hu dependent.\n\nSo, selling balloon for INR 9, please let me know in case you want to buy.\n\nThis INR 9 balloon can't guarantee you a 45 LPA job though.",
        "engagement": 189,
        "line_count": 13,
        "language": "Hinglish",
        "tags": [
            "Self Improvement",
            "Love"
        ]
    },
    {
        "text": "My only Valentine this year is my laptop -\n\nOverheats when things get intense\n\nIgnores me when I need it the most\n\nShuts down randomly without an explanation\n\nBasically, it's toxic, unpredictable, and emotionally unavailable… but hey, at least it won’t leave me for someone richer!",
        "engagement": 220,
        "line_count": 6,
        "language": "English",
        "tags": [
            "Toxic Relationship",
            "Love"
        ]
    },
    {
        "text": "We were fighting incest jokes.\n\nThis is a reflection of a mindset. A mindset that normalizes rape jokes. A mindset that hides behind anonymity to spew hatred. A mindset that laughs while dehumanizing women.\n\nIf you hate the question asked by Ranveer, how can you be okay with this?\n\nThere's a difference between criticism and hate.\n\nYou can criticise people for their actions.\n\nIf you don’t like someone’s opinion, say why. If you think they’re wrong, explain how. But resorting to violence, abuse, and threats? That’s not criticism. That’s harassment.",
        "engagement": 117,
        "line_count": 9,
        "language": "English",
        "tags": [
            "Toxic Behavior"
        ]
    }
]
